#include "用户界面接口实现_输入x.h"
namespace 用户界面::接口实现 {
void C手柄x::f初始化(输入x::I手柄 &a) {
	m手柄 = &a;
	//m映射.fs映射((输入::t索引)E按键::e上, (输入::t索引)输入x::E手柄按键::e上);
	//m映射.fs映射((输入::t索引)E按键::e下, (输入::t索引)输入x::E手柄按键::e下);
	//m映射.fs映射((输入::t索引)E按键::e左, (输入::t索引)输入x::E手柄按键::e左);
	//m映射.fs映射((输入::t索引)E按键::e右, (输入::t索引)输入x::E手柄按键::e右);
	m映射.fs映射((输入::t索引)E按键::e确定, (输入::t索引)输入x::E手柄按键::a);
	m映射.fs映射((输入::t索引)E按键::e取消, (输入::t索引)输入x::E手柄按键::b);
	m映射.fs映射((输入::t索引)E按键::e切换, (输入::t索引)输入x::E手柄按键::x);
	m映射.fs映射((输入::t索引)E按键::e跳过, (输入::t索引)输入x::E手柄按键::y);
}
void C手柄x::f更新() {
	m映射.m按键.f覆盖上次();
	m映射.m按键.f清空这次();
	m映射.f更新(*m手柄);
	const auto &v方向 = m手柄->f方向((输入::t索引)输入x::E手柄方向::e合并);
	if (abs(v方向.x) > 0.5f) {
		if (v方向.x > 0) {
			m映射.m按键.m这次[(输入::t索引)E按键::e右] |= true;
		} else {
			m映射.m按键.m这次[(输入::t索引)E按键::e左] |= true;
		}
	}
	if (abs(v方向.y) > 0.5f) {
		if (v方向.y > 0) {
			m映射.m按键.m这次[(输入::t索引)E按键::e上] |= true;
		} else {
			m映射.m按键.m这次[(输入::t索引)E按键::e下] |= true;
		}
	}
}
输入::S按键 C手柄x::f按键(E按键 a) const {
	return m映射.m按键.f按键((输入::t索引)a);
}

}