#include "用户界面接口实现_输入w.h"
namespace 用户界面::接口实现 {
//==============================================================================
// 键盘
//==============================================================================
void C键盘w::f初始化(输入w::I键盘 &a) {
	m键盘 = &a;
	m映射.fs映射((输入::t索引)E按键::e上, 输入w::e键上);
	m映射.fs映射((输入::t索引)E按键::e下, 输入w::e键下);
	m映射.fs映射((输入::t索引)E按键::e左, 输入w::e键左);
	m映射.fs映射((输入::t索引)E按键::e右, 输入w::e键右);
	m映射.fs映射((输入::t索引)E按键::e确定, 输入w::e键z);
	m映射.fs映射((输入::t索引)E按键::e取消, 输入w::e键x);
}
void C键盘w::f更新() {
	m映射.f更新(*m键盘);
}
输入::S按键 C键盘w::f按键(E按键 a) const {
	return m映射.f按键((输入::t索引)a);
}
//==============================================================================
// 鼠标
//==============================================================================
void C鼠标w::f初始化(输入w::I鼠标 &a) {
	m鼠标 = &a;
	m映射.fs映射((输入::t索引)E按键::e确定, 0);
	m映射.fs映射((输入::t索引)E按键::e取消, 1);
}
void C鼠标w::f更新() {
	m映射.f更新(*m鼠标);
}
输入::S按键 C鼠标w::f按键(E按键 a) const {
	return m映射.m按键.f按键((输入::t索引)a);
}
t向量2 C鼠标w::f坐标() const {
	const auto &v坐标 = m鼠标->f坐标();
	return {v坐标.x, v坐标.y};
}
//==============================================================================
// 触摸
//==============================================================================
void C触摸w::f初始化(输入w::I触摸 &a) {
	m触摸 = &a;
}
void C触摸w::f更新() {
	if (m触摸->f触控点数() > 0) {
		m点 = m触摸->fg触控点(0);
		const auto &v坐标 = m点->f坐标();
		m坐标 = {v坐标.x, v坐标.y};
	}
}
输入::S按键 C触摸w::f按键(E按键 a) const {
	if (m点 && a == E按键::e确定) {
		return m点->f按键();
	}
	return {false, false};
}
t向量2 C触摸w::f坐标() const {
	return m坐标;
}

}